{
  "backend/main.mo": "Motoko backend actor defining RoomListing type and storage with functions to add room listings and query available/all rooms using a Map data structure.",
  "feature_evidence.json": "Feature evidence report documenting PWA implementation including manifest configuration, service worker, icon assets, and app name updates with high confidence test mappings.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the Bachelor Room Finder app's routing, components, styling, and PWA functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, defining a warm color palette for the application.",
  "frontend/index.html": "HTML entry point with PWA meta tags, manifest link, theme color, and app title \"Bachelor Room Finder\".",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, theme colors, and standalone display mode for Bachelor Room Finder.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for static assets and network-first for API calls with offline fallback support.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with three routes (home, room detail, add listing) wrapped in a Layout component.",
  "frontend/src/components/Layout.tsx": "Layout wrapper providing Navigation header, main content area, and footer with caffeine.ai attribution across all pages.",
  "frontend/src/components/Navigation.tsx": "Sticky header with logo, app title, navigation buttons for browsing/adding rooms, and conditional PWA install button.",
  "frontend/src/components/RoomCard.tsx": "Reusable card component displaying room preview with image, title, location, rent amount, room type badge, and view details button.",
  "frontend/src/hooks/useActor.ts": "React Query hook managing backend actor creation with Internet Identity authentication, returning actor instance with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/usePWAInstall.ts": "React hook that manages Progressive Web App installation state and prompts, detecting if the app is installable, already installed, or running in standalone mode.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching available/all rooms and adding room listings, with automatic cache invalidation and toast notifications on success/error.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm color palette (terracotta, sage, beige) for light and dark themes, including chart colors and design tokens.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AddListingPage.tsx": "Form page for adding new room listings with validation, amenity selection, room type/availability dropdowns, and success confirmation screen after submission.",
  "frontend/src/pages/HomePage.tsx": "Landing page displaying a grid of available room listings with loading and empty states, showing room cards fetched from the backend.",
  "frontend/src/pages/RoomDetailPage.tsx": "Detail page for individual room listings showing full information including image, location, rent, amenities, room type, and contact details with back navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines a custom design system with OKLCH color variables, custom fonts (Inter, Poppins), extended theme tokens for UI components, and includes typography, container queries, and animation plugins.",
  "project_state.json": "Project state file tracking a room rental listing PWA application for bachelor accommodations, documenting existing features (homepage grid, detail pages, add listing form, PWA configuration), architectural notes, and image requirements for app icons."
}