{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add room photo upload functionality to frontend",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Add multiple image upload functionality to AddListingPage form with preview and validation",
      "acceptanceCriteria": [
        "File input field accepts multiple image files (JPEG, PNG)",
        "Preview thumbnails display selected images before submission",
        "Images are converted to base64 or uploaded format compatible with backend",
        "Form validation ensures at least one photo is uploaded",
        "Upload progress or loading state is shown during submission"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AddListingPage.tsx",
          "operation": "modify",
          "description": "Add file input field for multiple image selection with type accept='image/jpeg,image/png'. Add state to manage selected files array. Convert selected image files to ExternalBlob instances using ExternalBlob.fromBytes() for each file. Display preview thumbnails in a grid showing selected images with remove option. Add form validation requiring at least one photo before submission. Integrate withUploadProgress() to track upload percentage during form submission and display loading state. Pass photos array as ExternalBlob[] to the addRoomListing mutation. Use the blob-storage component to support image upload by creating ExternalBlob instances from file data. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Update RoomCard to display first uploaded photo with fallback to placeholder",
      "acceptanceCriteria": [
        "RoomCard renders the first photo from the photos array when available",
        "Placeholder image displays when photos array is empty or undefined",
        "Images maintain proper aspect ratio and card layout"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RoomCard.tsx",
          "operation": "modify",
          "description": "Update image src logic to use listing.photos[0]?.getDirectURL() when photos array exists and has items. Fall back to frontend/public/assets/generated/room-placeholder.dim_800x600.png when photos array is empty, undefined, or null. Ensure img element maintains aspect-ratio styling for proper card layout regardless of image source. Use the blob-storage component's ExternalBlob.getDirectURL() method to retrieve the direct URL for streaming and caching. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Update RoomDetailPage to display all photos in interactive gallery with navigation",
      "acceptanceCriteria": [
        "All uploaded photos are displayed in an interactive gallery or carousel",
        "Users can navigate between photos using next/previous controls or thumbnails",
        "Main image displays at appropriate size with proper aspect ratio",
        "Gallery handles single photo, multiple photos, and no photos scenarios gracefully"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/RoomDetailPage.tsx",
          "operation": "modify",
          "description": "Replace single image display with gallery component showing all photos from listing.photos array. Add state to track currently selected photo index. Render main image using photos[selectedIndex]?.getDirectURL() with proper aspect ratio styling. Add previous/next button controls to navigate between photos, disabled appropriately at array boundaries. Display thumbnail strip below main image showing all photos as clickable previews. Handle edge cases: show placeholder from frontend/public/assets/generated/room-placeholder.dim_800x600.png when photos array is empty, show single image without navigation when only one photo exists, show full gallery controls when multiple photos exist. Use the blob-storage component's ExternalBlob.getDirectURL() method for all photo URLs to leverage streaming and caching. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Update useQueries hooks to handle photos field in room listing operations",
      "acceptanceCriteria": [
        "useAddRoomListing mutation includes photos parameter in the backend call",
        "Query hooks properly type and return photos field from backend responses",
        "TypeScript types are updated to include photos field"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update useAddRoomListing mutation function signature to accept photos parameter of type ExternalBlob[]. Pass photos array to actor.addRoomListing backend call as the ninth parameter matching the backend interface signature. Update RoomListing TypeScript type interface to include photos field as Array<ExternalBlob> matching the backend.d.ts interface. Ensure useGetAvailableRooms and useGetAllRooms query hooks properly return the photos field in their response data. No changes needed to invalidation logic as photos are part of existing RoomListing type."
        }
      ]
    }
  ]
}